第八章 数据集成与共享

# 1. 简介
数据集成与共享（DII，Data Integration and Interoperability）描述了数据存储、应用程序和组织之间的数据移动和整合相关过程. 数据集成是将数据整合成物理的或虚拟的一致形式。数据共享是多个系统之间进行通信的能力。数据集成与共享解决方案支撑了大多数组织所依赖的基本数据管理功能：  
•	数据迁移和转换
•	数据整合到Hub或Marts
•	将供应商的程序包集成到组织的应用程序组合中
•	应用程序与跨组织的数据共享
•	跨数据存储库和数据中心分发数据
•	数据归档
•	数据接口管理  
•	获取和采集外部数据
•	结构化和非结构化数据集成
•	提供运营智能和管理决策支持
数据集成与共享依赖于如下数据管理的其他领域：
•	数据治理：用于转换规则和消息结构管理
•	数据架构：用于解决方案设计 
•	数据安全：确保解决方案对数据的安全性进行适当的保护，无论数据是持久化的还是虚拟化的状态，或者是在应用程序和组织之间流动着。
•	元数据：用于跟踪数据的技术存量（持久化、虚拟化和移动性）、数据的业务含义、数据转换的业务规则、数据操作历史和数据血缘
•	数据存储和操作：管理解决方案的物理实例化
•	数据建模与设计：用于设计数据结构，包括数据库中的物理持久化的结构、虚拟的数据结构以及应用程序和组织之间传递的消息结构
数据集成与共享对数据仓库和商业智能以及参考数据和主数据管理至关重要，因为所有这些系统都在关注从源系统到整合数据中心，以及从中心系统Hub到目标系统的数据转换和整合。在目标系统，数据将传递给包括系统和人在内的数据消费者。
数据集成与共享是大数据管理新兴领域的核心。大数据旨在整合各种类型的数据，包括存储在数据库中的结构化数据，存储在文档或文件中的非结构化文本数据，以及其他类型的非结构化数据，如音频、视频和流媒体数据。这种数据整合后可以被用来进行挖掘、开发预测模型并将其部署在业务智能活动中。
 
 
1.1 业务驱动因素Business Drivers  
数据集成与共享的主要目的是为了对数据移动进行有效管理。由于大多数组织都有数以百计的数据库和存储库，因此每个信息技术组织的一个中心责任就是管理数据在组织内内部的存储库与其他组织之间的双向流动过程。如果对不当，那么数据流动过程会浪费掉IT资源和能力，从而影响传统应用和数据管理领域的支撑需求dwarf the support requirements of traditional application and data management areas。
从软件供应商购买应用程序而不是自行开发定制化应用程序，扩大了企业数据集成与共享的需求。每个购买的应用程序都有自己的主数据存储库、事务数据存储库和报表数据存储库，而这些数据存储库必须与组织中的其他数据存储库互相集成。更有甚者，企业资源计划（ERP）系统运营者该组织的共同功能，极端情况还会包含组织中的所有数据存储库。他们也必须将数据与其他的组织数据集成在一起。
 
 
 

对企业来讲，要管理数据集成复杂性和以及相关联的成本，就要建立数据集成架构。企业级的数据集成设计远远比比分散的或点对点的解决方案更有效果、成本效率更高。在应用程序之间点对点地进行解决方案开发可能产生出数千到数百万的接口，即使最有效率和最有能力的IT支撑组织也会被迅速拖垮。
数据中心Data Hub如数据库和主数据解决方案有助于通过整合许多应用程序所需的数据，并为这些应用程序提供一致的数据视图来缓解这个问题。类似地，使用企业数据集成技术（如集线器Hub和Spoke集成和规范消息模型）可以大大简化管理需要跨组织共享的操作和事务数据的复杂性。
另一个业务驱动因素是管理支撑成本。在使用多种技术来移动数据时，每种技术都需要特定的开发和维护技能，这样都会造成支撑成本增加。传统工具的应用可以减少支撑和人力成本和提高故障排除工作的效率。降低接口管理的复杂性不仅可以减少接口的维护成本，并且可以让31支撑资源优先且更有效地部署在其他组织上。
数据集成与共享（DII）还支持组织遵守数据处理标准和规则的能力。企业级数据集成与共享系统可以重用代码来实现遵从性规则和简化遵从性验证。
